openfoam_cases/of_heat_sink_medium/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (1 0 0);
        name            parabolicInlet;
        code            #{
            const vectorField& Cf = patch().Cf();
            vectorField& fld = *this;
            forAll(Cf, i)
            {
                const scalar y = Cf[i].y();
                fld[i] = vector(1.5*(1.0 - sqr(2.0*y - 1.0)), 0, 0);
            }
        #};
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
    fins
    {
        type            noSlip;
    }
}


// ************************************************************************* //
