openfoam_cases/of_heat_sink_medium/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p   { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.05; }
    "(U|T)" { solver smoothSolver; smoother symGaussSeidel;
              tolerance 1e-8; relTol 0.1; nSweeps 1; }
}
SIMPLE
{
    consistent              yes;
    nNonOrthogonalCorrectors 2;
    residualControl { p 1e-4; U 1e-4; }
}
relaxationFactors
{
    equations { U 0.9; T 0.9; }
}
